#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1maws_lightsail_static_ip.amplifica: Refreshing state... [id=amplifica][0m
[0m[1maws_lightsail_instance.amplifica: Refreshing state... [id=amplifica_server][0m
[0m[1mcloudflare_record.amplifica: Refreshing state... [id=ad60a43465cd244eafc054a81299b3b1][0m
[0m[1maws_lightsail_static_ip_attachment.amplifica: Refreshing state... [id=amplifica][0m
[0m[1maws_lightsail_instance_public_ports.amplifica: Refreshing state... [id=amplifica_server-3143533893][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_lightsail_instance.amplifica[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lightsail_instance" "amplifica" {
      [33m~[0m [0m[1m[0marn[0m[0m                = "arn:aws:lightsail:us-east-2:762560579492:Instance/47cab0d5-ba99-4ca4-911e-70f3270f30c5" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcpu_count[0m[0m          = 1 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcreated_at[0m[0m         = "2022-01-31T18:42:27Z" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                 = "amplifica_server" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mipv6_address[0m[0m       = "2600:1f16:9c6:bb00:c831:afda:579c:7696" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mipv6_addresses[0m[0m     = [
          [31m-[0m [0m"2600:1f16:9c6:bb00:c831:afda:579c:7696",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mis_static_ip[0m[0m       = true [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mkey_pair_name[0m[0m      = "LightsailDefaultKeyPair" [90m->[0m [0m[90mnull[0m[0m
        [1m[0mname[0m[0m               = "amplifica_server"
      [33m~[0m [0m[1m[0mprivate_ip_address[0m[0m = "172.26.0.99" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpublic_ip_address[0m[0m  = "3.14.32.54" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mram_size[0m[0m           = 1 [33m->[0m [0m(known after apply)
        [1m[0mtags[0m[0m               = {
            "poc" = "true"
        }
      [33m~[0m [0m[1m[0muser_data[0m[0m          = <<-EOT [31m# forces replacement[0m[0m
            #!/bin/bash
            
            ##############################################################################
            # INSTALLING R, RSTUDIO SERVER AND ALL DEPENDENCIES
            ##############################################################################
            
            # Add a swap file to prevent build time OOM errors
            fallocate -l 16G /swapfile
            mkswap /swapfile
            swapon /swapfile
            echo '/swapfile none swap sw 0 0' | sudo tee -a /etc/fstab
            echo "vm.swappiness=10" >> /etc/sysctl.conf
            sysctl vm.swappiness=10
            
            sysctl vm.vfs_cache_pressure=50
            echo "vm.vfs_cache_pressure=50" >> /etc/sysctl.conf
            
            export DEBIAN_FRONTEND=noninteractive
            
            mkdir -p /root/.ssh /home/ubuntu/.ssh
            touch "/root/.ssh/authorized_keys"
            touch "/home/ubuntu/.ssh/authorized_keys"
            
          [31m-[0m [0mecho "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGk0PvanXFve78EL4PRq70EL+6/afnBQr3atdKYcRgjA diraol@berta" >> "/root/.ssh/authorized_keys"
          [31m-[0m [0mecho "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPBvCjgYwSkK3etS8pdqEKgPjAlVIGWbsbcVbuTz630h infra+amplifica@azmina.com.br" >> "/root/.ssh/authorized_keys"
          [31m-[0m [0m
          [31m-[0m [0mecho "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGk0PvanXFve78EL4PRq70EL+6/afnBQr3atdKYcRgjA diraol@berta" >> "/home/ubuntu/.ssh/authorized_keys"
          [32m+[0m [0mecho "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGk0PvanXFve78EL4PRq70EL+6/afnBQr3atdKYcRgjA diraol@berta" | tee -a "/root/.ssh/authorized_keys" >> "/home/ubuntu/.ssh/authorized_keys"
            echo "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPBvCjgYwSkK3etS8pdqEKgPjAlVIGWbsbcVbuTz630h infra+amplifica@azmina.com.br" >> "/home/ubuntu/.ssh/authorized_keys"
            
            chown ubuntu:ubuntu "/home/ubuntu/.ssh/authorized_keys"
          [31m-[0m [0mchmod 400 /home/ubuntu/.ssh/authorized_keys
          [32m+[0m [0mchmod 700 /home/ubuntu/.ssh
          [32m+[0m [0mchmod 600 /home/ubuntu/.ssh/authorized_keys
            
          [32m+[0m [0m# Download rstudio server in a background task
          [32m+[0m [0mwget -q https://download2.rstudio.org/server/bionic/amd64/rstudio-server-2021.09.1-372-amd64.deb -O /tmp/rstudio_server_install.deb &
          [32m+[0m [0m# Download shiny server in a background task
          [32m+[0m [0mwget -q https://download3.rstudio.org/ubuntu-14.04/x86_64/shiny-server-1.5.17.973-amd64.deb -O /tmp/shiny_server_install.deb &
          [32m+[0m [0m
            apt update
          [31m-[0m [0mapt upgrade -yqq
          [31m-[0m [0mapt autoremove -yqq
            apt install --no-install-recommends -yqq \
                software-properties-common \
                dirmngr \
                build-essential \
                zlib1g-dev
            
            apt-key adv \
                --keyserver keyserver.ubuntu.com \
                --recv-keys E298A3A825C0D65DFD57CBB651716619E084DAB9
            wget -qO- https://cloud.r-project.org/bin/linux/ubuntu/marutter_pubkey.asc | \
                sudo tee -a /etc/apt/trusted.gpg.d/cran_ubuntu_key.asc
            add-apt-repository "deb https://cloud.r-project.org/bin/linux/ubuntu $(lsb_release -cs)-cran40/"
            
            # Install R-base
            apt update
            apt install --no-install-recommends r-base -yqq
            
            # Install r-server
          [31m-[0m [0mwget https://download2.rstudio.org/server/bionic/amd64/rstudio-server-2021.09.1-372-amd64.deb -O /tmp/rstudio_server_install.deb
            apt install /tmp/rstudio_server_install.deb -yqq
            
            # Install shiny package
            R --no-save -e "install.packages('shiny', repos='https://cran.rstudio.com/')"
            
            # Install shiny-server
          [31m-[0m [0mwget https://download3.rstudio.org/ubuntu-14.04/x86_64/shiny-server-1.5.17.973-amd64.deb -O /tmp/shiny_server_install.deb
            apt install /tmp/shiny_server_install.deb -yqq
            
          [32m+[0m [0m# access
          [32m+[0m [0mecho "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGk0PvanXFve78EL4PRq70EL+6/afnBQr3atdKYcRgjA diraol@berta" >> "/home/shiny/.ssh/authorized_keys"
          [32m+[0m [0mecho "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPBvCjgYwSkK3etS8pdqEKgPjAlVIGWbsbcVbuTz630h infra+amplifica@azmina.com.br" >> "/home/shiny/.ssh/authorized_keys"
          [32m+[0m [0mchown shiny:shiny "/home/ubuntu/.ssh/authorized_keys"
          [32m+[0m [0mchmod 700 /home/shiny/.ssh
          [32m+[0m [0mchmod 600 /home/shiny/.ssh/authorized_keys
          [32m+[0m [0m
            # Setup the shiny server
          [32m+[0m [0mmkdir -p /src/shiny-server/amplifica
          [32m+[0m [0mchown shiny:shiny /src/shiny-server/amplifica
            sed -i 's/port 3838/port 80/g' /etc/shiny-server/shiny-server.conf
            sed -i 's!site_dir /srv/shiny-server!app_dir /src/shiny-server/amplifica!g' /etc/shiny-server/shiny-server.conf
            sed -i 's/directory_index on;/directory_index off;/g' /etc/shiny-server/shiny-server.conf
            
            systemctl restart shiny-server
            
          [32m+[0m [0mapt upgrade -yqq
          [32m+[0m [0mapt autoremove -yqq
          [32m+[0m [0m
            CPUS=$(nproc)
            if [[ "${CPUS}" != 1 ]]; then
                CPUS=$(( CPUS - 1 ))
            fi
            
            # Install additional packages
            cat << EOF > r_install_packages.R
            update.packages(ask=FALSE,
                Ncpus=${CPUS},
                lib="/usr/local/lib/R/site-library",
                checkBuilt=TRUE,
                quiet=TRUE,
                repos = "http://cran.us.r-project.org")
            
            install.packages(lib="/usr/local/lib/R/site-library",
            c(
                "R.utils",
                "stringr",
                "tidyverse"
                ),
                Ncpus=${CPUS},
                ask=FALSE,
                checkBuilt=TRUE,
                quiet=TRUE,
                repos = "http://cran.us.r-project.org"
            )
            
            q()
            EOF
            chmod +rw r_install_packages.R
            R --no-save < r_install_packages.R
            
            echo "www-port=80" > /etc/rstudio/rserver.conf
            echo "www-thread-pool-size=${CPUS}" >> /etc/rstudio/rserver.conf
            echo "session-timeout-minutes=0" >> /etc/rstudio/rsession.conf
            
            systemctl restart rstudio-server.service
          [31m-[0m [0m
          [31m-[0m [0mecho "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGk0PvanXFve78EL4PRq70EL+6/afnBQr3atdKYcRgjA diraol@berta" >> "/home/shiny/.ssh/authorized_keys"
          [31m-[0m [0mecho "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPBvCjgYwSkK3etS8pdqEKgPjAlVIGWbsbcVbuTz630h infra+amplifica@azmina.com.br" >> "/home/shiny/.ssh/authorized_keys"
          [31m-[0m [0mchown shiny:shiny "/home/ubuntu/.ssh/authorized_keys"
          [31m-[0m [0mchmod 400 /home/shiny/.ssh/authorized_keys
        EOT
      [33m~[0m [0m[1m[0musername[0m[0m           = "ubuntu" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_lightsail_static_ip_attachment.amplifica[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_lightsail_static_ip_attachment" "amplifica" {
      [33m~[0m [0m[1m[0mid[0m[0m             = "amplifica" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_name[0m[0m  = "amplifica_server" [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mip_address[0m[0m     = "3.14.32.54" [33m->[0m [0m(known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 2 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @diraol, Action: `pull_request`*